---
type: Ceiling
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# Ceiling

`Autodesk.Revit.DB.Ceiling` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | — | `` |
| Property | Parameter | — | `` |
| Property | SketchId | 2022 | `public ElementId SketchId { get ; }` |